[
    "Sea turtle mating dynamics are both highly elusive and interesting! For instance, we know using genetic studies, that some populations exhibit high degree of polyandry, that is, females will mate with more than one male during the mating season!",
    "The rate of polyandry in Zakynthos (females mating with more than one male), is among the highest (if not the highest) in the world: 93% of the nests have contributions from more than one male!",
    "It is generally thought that female turtles prefer not to spend energy eating during their breeding period. Indeed, after 15 years of in-water observation of the Zakynthos females, there have been very few instances of females foraging and these are rather opportunistic.",
    "About 15% of the times, female turtles in Zakynthos Island breed in two consecutive years. However, we have recorded some females visiting the island for up to 5 years in a row!",
    "Many sea turtles has been exhibiting consistent in-water behaviour over the years, which makes us think that this can be considered a part of their \"personalities”!",
    "When the wind conditions are right, the warm surface water is accumulated in specific parts of Laganas Bay, Zakynthos, late in the afternoon, resulting in large aggregations of turtles. It is not uncommon to see 3, 4 or even 5 turtles at the same time!",
    "The photo-ID program of the loggerhead sea turtles of Zakynthos Island, Greece, is one of the oldest in the world, spanning 25 years! It is used as a tool in a variety of scientific studies such as studying in-water behaviours, estimating survival rates for the population, and measuring the impact of tourism on individual turtles.",
    "During mating season, males often attempt to bite the females at their necks and other skin parts. As a result, females come out of the mating season in a pretty bad condition but two weeks later, most of the wounds on their faces and skin are essentially healed!",
    "We have recorded sea turtles in Zakynthos who we believe are at least 60 years old! Mediterranean loggerheads start breeding after 15-25 years of age, and some of these have been reproducing for almost 40 years now!",
    "Boat collisions, swallowing fishing hooks and entanglement in fishing lines and eventually loss of flippers is a sad reality for sea turtles. ARCHELON, the Sea Turtle Protection Society of Greece operates a rescue and rehabilitation centre in Athens Greece to deal with such incidents.",
    "In Zakynthos, one can see female loggerheads with reproductive longevity of more than 37 years! The absolute record is held by \"X23103\" an Australian flatback sea turtle who has been nesting in Mon Repos, Queensland for 47 years, first tagged in 1974!",
    "In order to be certain than a turtle is a male, it must have a tail must be longer than 7-8 cms beyond its carapace end. When they are mature, the tail length can be longer than 30 cms!",
    "Female loggerheads are becoming less and less receptive to mating at end of the mating season in the Mediterranean (end of May). However some males will still keep making futile mating attempts during June.",
    "Mediterranean female loggerheads typically reproduce every 2-3 years whereas the males reproduce every 1-2 years.",
    "Boat collisions with turtles is a persisting problem in Zakynthos that has been poorly addressed. Half of the most intensely viewed residents turtles have sustained propeller injuries.",
    "The COVID-19 pandemic reduced the tourist pressure on turtles (number of viewings during turtle spotting tours), with the overall pressure during 2020 just 25% of that of 2019, rising to 50% in 2021. However, during 2022-24, the tourist pressure has risen to all time record levels.",
    "Loggerhead sea turtles are capable of getting themselves partially buried in the sand by actively moving their front flippers and stirring the sea bottom sediment.",
    "Female loggerheads often enjoy spa services in fish cleaning stations where up to 60 fish can clean their carapaces at a given time.",
    "Cleaning fish can sometimes be annoying for loggerhead sea turtles especially when they bite the soft parts of their skin. In that case they make these really funny avoiding movements that you rarely see in other circumstances.",
    "Females are rarely seen foraging during the nesting season. This is a very opportunistic behaviour as females typically do not invest time on foraging while breeding.",
    "Loggerhead turtles are often involved in fights with other turtles over food resources. The more rare and scarce these resources are, the more intense these fights!",
    "Based on our long term in-water observations and photo-identification, we have now plenty of indications that barnacles can stay in turtles for more than a year.",
    "Upon a close look, one can notice salt excretion (thick fluid) coming from the eyes of turtles. These secretions come from their lachrymal salt glands which are located behind their eyes and it helps them maintaining lower salinity levels in their bodies.",
    "Propeller injuries is a persisting problem for the resident sea turtles of Zakynthos as despite the high observation pressure, these turtles remain in the area and they are subject to increased anthropogenic threats.",
    "Female loggerheads like to rest on the soft mattress that the endemic seagrass Posidonia oceanica provides! They most likely spend the night there and one can still see them early in the morning. Typically their head and flippers are camouflaged by the seagrass leaving only the rock-alike carapace exposed.",
    "Sea turtles have excellent defensive capabilities against predators. Flipping of the shell is an excellent defence strategy for sea turtles, protecting vulnerable parts of their body. In fact, some sea turtle species (e.g. leatherbacks) have been observed flipping themselves completely upside down while swimming, in an effort to protect from threats coming from below them.",
    "For more than 40 years now, ARCHELON, the Sea Turtle Protection Society of Greece has been monitoring the breeding activities of the loggerhead sea turtles in Laganas Bay, Zakynthos. This is the oldest standardized sea turtle monitoring project in the Mediterranean and one of the oldest in the world. The area is used by IUCN's Marine Turtle Specialist Group as an \"Index\" area for the assessment of long-term population trends for the Mediterranean loggerhead sea turtle.",
    "Loggerhead sea turtles many times use the endemic Mediterranean seagrass Posidonia oceanica as a resting and sleeping point. You would think that this provides a perfect camouflage as, at least to the human eye, they look like rocks on top of the seagrass.",
    "Loggerhead sea turtles sometimes swim around in an inquisitive manner and regularly put their beak-like mouths in seemingly random spots. Sometimes they get nothing but sometimes they catch delicious molluscs which they eat by easily smashing their shells (you can in fact hear the shell cracking if you are close enough)! How are sea turtles able to locate sea shells that are buried in the sand? Nobody really knows for sure but it seems that \"smell\" could be the main factor.",
    "Loggerhead sea turtles have normally 3 scales behind their eyes (postocular scales). Very rarely, one can see individuals with 2 or 4 postocular scales.",
    "The epibiotic barnacle Chelonibia testudinaria can be commonly found attached to the bodies of turtles. Individual turtles vary in their barnacle loads, possibly as a function of their cleaning frequency or health.",
    "Loggerhead sea turtles often engage into aggressive fighting over food resources. Recognising individuals through photo ID (comparing their scales on their heads) has been a powerful tool to understand the social structure and ecological dynamics in the area.",
    "Mediterranean sea turtles sexually mature at 15-25 years of age.",
    "Loggerhead sea turtles have a very interesting technique in order to camouflage themselves: By moving their flippers, they lift up sea grass and sand from the bottom of the sea and when these are slowly settling down, the turtle ends up being buried underneath!"
]
